# 1) Import the required libraries (sklearn, pandas, numpy). Import datasets. Concatenate the datasets. Display first 5 rows.

In [1]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
import re

In [2]:
from sklearn.linear_model import LogisticRegression
from sklearn.model_selection import train_test_split
train=pd.read_csv('https://raw.githubusercontent.com/Shreyas3108/Titanic-EDA-and-Survival-prediction/master/train.csv ')
test=pd.read_csv('https://raw.githubusercontent.com/Shreyas3108/Titanic-EDA-and-Survival-prediction/master/test.csv')

In [43]:
df = pd.concat([train,test] , ignore_index = True , sort = True)
df.head()

,Age,Cabin,Embarked,Fare,Name,Parch,PassengerId,Pclass,Sex,SibSp,Survived,Ticket
0,22.0,NaN,S,7.2500,"Braund, Mr. Owen Harris",0,1,3,male,1,0.0,A/5 21171
1,38.0,C85,C,71.2833,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,2,1,female,1,1.0,PC 17599
2,26.0,NaN,S,7.9250,"Heikkinen, Miss. Laina",0,3,3,female,0,1.0,STON/O2. 3101282
3,35.0,C123,S,53.1000,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,4,1,female,1,1.0,113803
4,35.0,NaN,S,8.0500,"Allen, Mr. William Henry",0,5,3,male,0,0.0,373450

In [44]:
df.describe()

,Age,Fare,Parch,PassengerId,Pclass,SibSp,Survived
count,1046.000000,1308.000000,1309.000000,1309.000000,1309.000000,1309.000000,891.000000
mean,29.881138,33.295479,0.385027,655.000000,2.294882,0.498854,0.383838
std,14.413493,51.758668,0.865560,378.020061,0.837836,1.041658,0.486592
min,0.170000,0.000000,0.000000,1.000000,1.000000,0.000000,0.000000
25%,21.000000,7.895800,0.000000,328.000000,2.000000,0.000000,0.000000
50%,28.000000,14.454200,0.000000,655.000000,3.000000,0.000000,0.000000
75%,39.000000,31.275000,0.000000,982.000000,3.000000,1.000000,1.000000
max,80.000000,512.329200,9.000000,1309.000000,3.000000,8.000000,1.000000

In [45]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 12 columns):
Age            1046 non-null float64
Cabin          295 non-null object
Embarked       1307 non-null object
Fare           1308 non-null float64
Name           1309 non-null object
Parch          1309 non-null int64
PassengerId    1309 non-null int64
Pclass         1309 non-null int64
Sex            1309 non-null object
SibSp          1309 non-null int64
Survived       891 non-null float64
Ticket         1309 non-null object
dtypes: float64(3), int64(4), object(5)
memory usage: 122.8+ KB

In [46]:
df['Survived'].value_counts()

0.0    549
1.0    342
Name: Survived, dtype: int64

In [47]:
df.isnull().sum()

Age             263
Cabin          1014
Embarked          2
Fare              1
Name              0
Parch             0
PassengerId       0
Pclass            0
Sex               0
SibSp             0
Survived        418
Ticket            0
dtype: int64

# 2) Remove NaN values from the column ‘Survived’.

In [48]:
df=df.dropna(subset=['Survived'])

In [49]:
df.isnull().sum()

Age            177
Cabin          687
Embarked         2
Fare             0
Name             0
Parch            0
PassengerId      0
Pclass           0
Sex              0
SibSp            0
Survived         0
Ticket           0
dtype: int64

# 3) Create a new column 'Has_Cabin' that tells you whether passengers had a cabin or not.

In [50]:
i=0
df['Has_Cabin']=""
for x in df['Cabin'].isnull():
  if x==True:
    df.loc[i,'Has_Cabin']=0
  else:
    df.loc[i,'Has_Cabin']=1
  i=i+1
df['Has_Cabin'].value_counts()

0    687
1    204
Name: Has_Cabin, dtype: int64

# 4) Create a new column “Title”, which will contain the titles of the passengers such as Mr., Mrs., etc. There should be five titles: Mr, Mrs, Master, Miss, and Special. 
(Hint: Use regular expression to replace the titles)

In [51]:
df['Title']=df['Name'].apply(lambda x: re.search('([A-Z][a-z]+)\.', x))
df['Title']=df['Title'].apply(lambda x: x.group())
print(df['Title'].value_counts())

Mr.          517
Miss.        182
Mrs.         125
Master.       40
Dr.            7
Rev.           6
Col.           2
Major.         2
Mlle.          2
Capt.          1
Ms.            1
Don.           1
Lady.          1
Countess.      1
Sir.           1
Mme.           1
Jonkheer.      1
Name: Title, dtype: int64

In [52]:
df['Title'] = df['Title'].replace(['Don.', 'Dona.', 'Rev.', 'Dr.', 'Major.', 'Lady.', 'Sir.', 'Col.', 'Capt.', 'Countess.', 'Jonkheer.','Mme.','Mlle.','Ms.'],'Special')

In [53]:
df['Title'].value_counts()

Mr.        517
Miss.      182
Mrs.       125
Master.     40
Special     27
Name: Title, dtype: int64

# 5) Impute the missing values using .fillna() method.

In [54]:
df['Age']=df['Age'].fillna(df['Age'].median())

In [55]:
df['Embarked'].value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [56]:
df['Embarked']=df['Embarked'].fillna('S')

# 6) Create two new columns “Categorical_age” and “Categorical_fare”, where you will put people that are within a certain range of age or fare in the same bin.

In [57]:
df['Categorical_age'] = pd.qcut(df.Age, q=4, labels=False )
df['Categorical_fare']= pd.qcut(df.Fare, q=4, labels=False)

In [58]:
df.head()

,Age,Cabin,Embarked,Fare,Name,Parch,PassengerId,Pclass,Sex,SibSp,Survived,Ticket,Has_Cabin,Title,Categorical_age,Categorical_fare
0,22.0,NaN,S,7.2500,"Braund, Mr. Owen Harris",0,1,3,male,1,0.0,A/5 21171,0,Mr.,0,0
1,38.0,C85,C,71.2833,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,2,1,female,1,1.0,PC 17599,1,Mrs.,3,3
2,26.0,NaN,S,7.9250,"Heikkinen, Miss. Laina",0,3,3,female,0,1.0,STON/O2. 3101282,0,Miss.,1,1
3,35.0,C123,S,53.1000,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,4,1,female,1,1.0,113803,1,Mrs.,2,3
4,35.0,NaN,S,8.0500,"Allen, Mr. William Henry",0,5,3,male,0,0.0,373450,0,Mr.,2,1

# 7) Drop columns Cabin, Name, Passengerid, Ticket, Age, Fare, SibSp, Parch.

In [59]:
df.drop(['Cabin','Name','PassengerId','Ticket','Age','Fare','SibSp','Parch'],axis=1,inplace=True)

# 8) Transform all variables into numeric ones using get_dummies().

In [60]:
df = pd.get_dummies(df)
df.head()

,Pclass,Survived,Has_Cabin,Categorical_age,Categorical_fare,Embarked_C,Embarked_Q,Embarked_S,Sex_female,Sex_male,Title_Master.,Title_Miss.,Title_Mr.,Title_Mrs.,Title_Special
0,3,0.0,0,0,0,0,0,1,0,1,0,0,1,0,0
1,1,1.0,1,3,3,1,0,0,1,0,0,0,0,1,0
2,3,1.0,0,1,1,0,0,1,1,0,0,1,0,0,0
3,1,1.0,1,2,3,0,0,1,1,0,0,0,0,1,0
4,3,0.0,0,2,1,0,0,1,0,1,0,0,1,0,0

# 9) Now we need training set and testing set. Use train_test_split() to split your dataset. 
X(Features) will be the dataset values without the column “Survived” and y(Targets) will be your “Survived” column values.

In [61]:
x = df.drop(['Survived'], axis = 1)
y = df['Survived']

# 10) Use logistic regression by passing your X_train and y_train.

In [69]:
from sklearn.model_selection import train_test_split
x_train, x_test, y_train, y_test = train_test_split(x, y, test_size = 0.3,random_state=0)

In [70]:
classifier = LogisticRegression()

In [71]:
classifier.fit(x_train, y_train)

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
          intercept_scaling=1, max_iter=100, multi_class='ovr', n_jobs=1,
          penalty='l2', random_state=None, solver='liblinear', tol=0.0001,
          verbose=0, warm_start=False)

# Prediction

In [73]:
y_pred = classifier.predict(x_test)

## 11) Print the accuracy score.

In [77]:
score = classifier.score(x_test, y_test)
print('Accuracy Score=',str(score))

Accuracy Score= 0.8134328358208955